d = new Tree('d');

		d.add(0,-1,' 分类树');


		d.add(1,0,'一级1','#');
		d.add(2,0,'一级2','#');
		d.add(3,0,'一级3','#');
		d.add(4,0,'一级4','#');
		d.add(5,0,'一级5','#');
		d.add(6,0,'一级6','#');



		d.add(7,1,'二级1','#');
		d.add(8,1,'二级2','#');
		d.add(9,1,'二级3','#');
		d.add(10,1,'二级4','#');
		d.add(11,1,'二级5','#');
		d.add(12,1,'二级6','#');
		
        d.add(13,12,'三级7','#');
		d.add(14,12,'三级8','#');
        d.add(15,12,'三级9','#');
		d.add(16,12,'三级','#');
        d.add(17,12,'三级','#');

		d.add(35,2,'二级1','#');		
		d.add(38,2,'二级2','#');

		
		document.write(d);
